[call api]
调用时间：2021-01-13 12.24.11
调用接口：generateTemplate
configName:OSPF
settingNum:0
configName:RIP
routerNum:0
commands:['configure terminal', 'interface s0/0/0', 'ip address 192.168.2.1 255.255.255.0', 'clock rate 64000', 'no shutdown', 'end']
获取Telnet:Router0的唯一对象……
Telnet:Router0对象未被创建，开始创建……
开始连接主机: 192.168.1.1
连接成功！
进入特权模式……
进入enable模式成功！
executeSomeCMD:
['configure terminal', 'interface s0/0/0', 'ip address 192.168.2.1 255.255.255.0', 'clock rate 64000', 'no shutdown', 'end']
executeSomeCMD-Result:
['configure terminal\nEnter configuration commands, one per line.  End with CNTL/Z.\nRouter(config)#', 'interface s0/0/0\nRouter(config-if)#', 'ip address 192.168.2.1 255.255.255.0\nRouter(config-if)#', 'clock rate 64000\nThis command applies only to DCE interfaces\nRouter(config-if)#', 'no shutdown\nRouter(config-if)#', 'end\nRouter#']
**程序输出**
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface s0/0/0
Router(config-if)#ip address 192.168.2.1 255.255.255.0
Router(config-if)#clock rate 64000
This command applies only to DCE interfaces
Router(config-if)#no shutdown
Router(config-if)#end
Router#


configName:RIP
routerNum:1
commands:['configure terminal', 'interface s0/0/0', 'ip address 192.168.2.2 255.255.255.0', 'clock rate 64000', 'no shutdown', 'end', 'configure terminal', 'interface s0/0/1', 'ip address 192.168.3.1 255.255.255.0', 'clock rate 64000', 'no shutdown', 'end']
获取Telnet:Router1的唯一对象……
Telnet:Router1对象未被创建，开始创建……
开始连接主机: 192.168.1.2
连接成功！
进入特权模式……
进入enable模式成功！
executeSomeCMD:
['configure terminal', 'interface s0/0/0', 'ip address 192.168.2.2 255.255.255.0', 'clock rate 64000', 'no shutdown', 'end', 'configure terminal', 'interface s0/0/1', 'ip address 192.168.3.1 255.255.255.0', 'clock rate 64000', 'no shutdown', 'end']
executeSomeCMD-Result:
['configure terminal\nEnter configuration commands, one per line.  End with CNTL/Z.\nRouter(config)#', 'interface s0/0/0\nRouter(config-if)#', 'ip address 192.168.2.2 255.255.255.0\nRouter(config-if)#', 'clock rate 64000\nRouter(config-if)#', 'no shutdown\nRouter(config-if)#', 'end\nRouter#', 'configure terminal\nEnter configuration commands, one per line.  End with CNTL/Z.\nRouter(config)#', 'interface s0/0/1\nRouter(config-if)#', 'ip address 192.168.3.1 255.255.255.0\nRouter(config-if)#', 'clock rate 64000\nRouter(config-if)#', 'no shutdown\nRouter(config-if)#', 'end\nRouter#']
**程序输出**
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface s0/0/0
Router(config-if)#ip address 192.168.2.2 255.255.255.0
Router(config-if)#clock rate 64000
Router(config-if)#no shutdown
Router(config-if)#end
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface s0/0/1
Router(config-if)#ip address 192.168.3.1 255.255.255.0
Router(config-if)#clock rate 64000
Router(config-if)#no shutdown
Router(config-if)#end
Router#


configName:RIP
routerNum:2
commands:['configure terminal', 'interface s0/0/1', 'ip address 192.168.3.2 255.255.255.0', 'clock rate 64000', 'no shutdown', 'end']
获取Telnet:Router2的唯一对象……
Telnet:Router2对象未被创建，开始创建……
开始连接主机: 192.168.1.3
连接成功！
进入特权模式……
进入enable模式成功！
executeSomeCMD:
['configure terminal', 'interface s0/0/1', 'ip address 192.168.3.2 255.255.255.0', 'clock rate 64000', 'no shutdown', 'end']
executeSomeCMD-Result:
['configure terminal\nEnter configuration commands, one per line.  End with CNTL/Z.\nRouter(config)#', 'interface s0/0/1\nRouter(config-if)#', 'ip address 192.168.3.2 255.255.255.0\nRouter(config-if)#', 'clock rate 64000\nThis command applies only to DCE interfaces\nRouter(config-if)#', 'no shutdown\nRouter(config-if)#', 'end\nRouter#']
**程序输出**
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface s0/0/1
Router(config-if)#ip address 192.168.3.2 255.255.255.0
Router(config-if)#clock rate 64000
This command applies only to DCE interfaces
Router(config-if)#no shutdown
Router(config-if)#end
Router#


[call api]
调用时间：2021-01-13 12.24.17
调用接口：generateTemplate
configName:OSPF
settingNum:0
commands: ['configure terminal', 'router ospf 1', 'network 192.168.2.0 0.0.0.255 area 0', 'network 10.0.0.0 0.255.255.255 area 51', 'end']

[call api]
调用时间：2021-01-13 12.25.53
调用接口：generateTemplate
configName:OSPF
settingNum:0
commands: ['configure terminal', 'router ospf 1', 'network 192.168.2.0 0.0.0.255 area 0', 'network 10.0.0.0 0.255.255.255 area 51', 'end']

[call api]
调用时间：2021-01-13 12.25.54
调用接口：executeSomeCommand
configName:OSPF
routerNum:0
commands:['configure terminal', 'router ospf 1', 'network 192.168.2.0 0.0.0.255 area 0', 'network 10.0.0.0 0.255.255.255 area 51', 'end']
获取Telnet:Router0的唯一对象……
Telnet:Router0对象已经创建，获取成功
executeSomeCMD:
['configure terminal', 'router ospf 1', 'network 192.168.2.0 0.0.0.255 area 0', 'network 10.0.0.0 0.255.255.255 area 51', 'end']
executeSomeCMD-Result:
['configure terminal\nEnter configuration commands, one per line.  End with CNTL/Z.\nRouter(config)#', 'router ospf 1\nRouter(config-router)#', 'network 192.168.2.0 0.0.0.255 area 0\nRouter(config-router)#', 'network 10.0.0.0 0.255.255.255 area 51\nRouter(config-router)#', 'end\nRouter#']
**程序输出**
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router ospf 1
Router(config-router)#network 192.168.2.0 0.0.0.255 area 0
Router(config-router)#network 10.0.0.0 0.255.255.255 area 51
Router(config-router)#end
Router#


[call api]
调用时间：2021-01-13 12.26.13
调用接口：ping
configName:OSPF
routerNum:0
commands:['ping 192.168.1.2']
获取Telnet:Router0的唯一对象……
Telnet:Router0对象已经创建，获取成功
executeSomeCMD:
['ping 192.168.1.2']
executeSomeCMD-Result:
['ping 192.168.1.2\n\nType escape sequence to abort.\nSending 5, 100-byte ICMP Echos to 192.168.1.2, timeout is 2 seconds:\n.!!!!\nSuccess rate is 80 percent (4/5), round-trip min/avg/max = 1/1/1 ms\nRouter#']
**程序输出**
Router#ping 192.168.1.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.2, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 1/1/1 ms
Router#


[call api]
调用时间：2021-01-13 12.26.24
调用接口：ping
configName:OSPF
routerNum:0
commands:['ping 192.168.1.200']
获取Telnet:Router0的唯一对象……
Telnet:Router0对象已经创建，获取成功
executeSomeCMD:
['ping 192.168.1.200']
executeSomeCMD-Result:
['ping 192.168.1.200\n\nType escape sequence to abort.\nSending 5, 100-byte ICMP Echos to 192.168.1.200, timeout is 2 seconds:\n....']
**程序输出**
Router#ping 192.168.1.200

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.200, timeout is 2 seconds:
....


[call api]
调用时间：2021-01-13 12.26.49
调用接口：ping
configName:OSPF
routerNum:0
commands:['ping 192.168.1.200']
获取Telnet:Router0的唯一对象……
Telnet:Router0对象已经创建，获取成功
executeSomeCMD:
['ping 192.168.1.200']
executeSomeCMD-Result:
['.\nSuccess rate is 0 percent (0/5)\nRouter#']
**程序输出**
Router#.
Success rate is 0 percent (0/5)
Router#


[call api]
调用时间：2021-01-13 12.27.06
调用接口：ping
configName:OSPF
routerNum:0
commands:['ping 192.168.1.200']
获取Telnet:Router0的唯一对象……
Telnet:Router0对象已经创建，获取成功
executeSomeCMD:
['ping 192.168.1.200']
executeSomeCMD-Result:
['ping 192.168.1.200\n\nType escape sequence to abort.\nSending 5, 100-byte ICMP Echos to 192.168.1.200, timeout is 2 seconds:\n.....\nSuccess rate is 0 percent (0/5)\nRouter#']
**程序输出**
Router#ping 192.168.1.200

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.200, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
Router#


[call api]
调用时间：2021-01-13 12.27.08
调用接口：ping
configName:OSPF
routerNum:0
commands:['ping 192.168.1.200']
获取Telnet:Router0的唯一对象……
Telnet:Router0对象已经创建，获取成功
executeSomeCMD:
['ping 192.168.1.200']
executeSomeCMD-Result:
['ping 192.168.1.200\n\nType escape sequence to abort.\nSending 5, 100-byte ICMP Echos to 192.168.1.200, timeout is 2 seconds:\n.....\nSuccess rate is 0 percent (0/5)\nRouter#']
**程序输出**
Router#ping 192.168.1.200

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.200, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
Router#


configName:RIP
routerNum:0
commands:['configure terminal', 'interface s0/0/0', 'ip address 192.168.2.1 255.255.255.0', 'clock rate 64000', 'no shutdown', 'end']
获取Telnet:Router0的唯一对象……
Telnet:Router0对象已经创建，获取成功
executeSomeCMD:
['configure terminal', 'interface s0/0/0', 'ip address 192.168.2.1 255.255.255.0', 'clock rate 64000', 'no shutdown', 'end']
executeSomeCMD-Result:
['configure terminal\nEnter configuration commands, one per line.  End with CNTL/Z.\nRouter(config)#', 'interface s0/0/0\nRouter(config-if)#', 'ip address 192.168.2.1 255.255.255.0\nRouter(config-if)#', 'clock rate 64000\nThis command applies only to DCE interfaces\nRouter(config-if)#', 'no shutdown\nRouter(config-if)#', 'end\nRouter#']
**程序输出**
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface s0/0/0
Router(config-if)#ip address 192.168.2.1 255.255.255.0
Router(config-if)#clock rate 64000
This command applies only to DCE interfaces
Router(config-if)#no shutdown
Router(config-if)#end
Router#


configName:RIP
routerNum:1
commands:['configure terminal', 'interface s0/0/0', 'ip address 192.168.2.2 255.255.255.0', 'clock rate 64000', 'no shutdown', 'end', 'configure terminal', 'interface s0/0/1', 'ip address 192.168.3.1 255.255.255.0', 'clock rate 64000', 'no shutdown', 'end']
获取Telnet:Router1的唯一对象……
Telnet:Router1对象已经创建，获取成功
executeSomeCMD:
['configure terminal', 'interface s0/0/0', 'ip address 192.168.2.2 255.255.255.0', 'clock rate 64000', 'no shutdown', 'end', 'configure terminal', 'interface s0/0/1', 'ip address 192.168.3.1 255.255.255.0', 'clock rate 64000', 'no shutdown', 'end']
executeSomeCMD-Result:
['configure terminal\nEnter configuration commands, one per line.  End with CNTL/Z.\nRouter(config)#', 'interface s0/0/0\nRouter(config-if)#', 'ip address 192.168.2.2 255.255.255.0\nRouter(config-if)#', 'clock rate 64000\nRouter(config-if)#', 'no shutdown\nRouter(config-if)#', 'end\nRouter#', 'configure terminal\nEnter configuration commands, one per line.  End with CNTL/Z.\nRouter(config)#', 'interface s0/0/1\nRouter(config-if)#', 'ip address 192.168.3.1 255.255.255.0\nRouter(config-if)#', 'clock rate 64000\nRouter(config-if)#', 'no shutdown\nRouter(config-if)#', 'end\nRouter#']
**程序输出**
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface s0/0/0
Router(config-if)#ip address 192.168.2.2 255.255.255.0
Router(config-if)#clock rate 64000
Router(config-if)#no shutdown
Router(config-if)#end
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface s0/0/1
Router(config-if)#ip address 192.168.3.1 255.255.255.0
Router(config-if)#clock rate 64000
Router(config-if)#no shutdown
Router(config-if)#end
Router#


configName:RIP
routerNum:2
commands:['configure terminal', 'interface s0/0/1', 'ip address 192.168.3.2 255.255.255.0', 'clock rate 64000', 'no shutdown', 'end']
获取Telnet:Router2的唯一对象……
Telnet:Router2对象已经创建，获取成功
executeSomeCMD:
['configure terminal', 'interface s0/0/1', 'ip address 192.168.3.2 255.255.255.0', 'clock rate 64000', 'no shutdown', 'end']
executeSomeCMD-Result:
['configure terminal\nEnter configuration commands, one per line.  End with CNTL/Z.\nRouter(config)#', 'interface s0/0/1\nRouter(config-if)#', 'ip address 192.168.3.2 255.255.255.0\nRouter(config-if)#', 'clock rate 64000\nThis command applies only to DCE interfaces\nRouter(config-if)#', 'no shutdown\nRouter(config-if)#', 'end\nRouter#']
**程序输出**
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface s0/0/1
Router(config-if)#ip address 192.168.3.2 255.255.255.0
Router(config-if)#clock rate 64000
This command applies only to DCE interfaces
Router(config-if)#no shutdown
Router(config-if)#end
Router#


[call api]
调用时间：2021-01-13 12.29.34
调用接口：generateTemplate
configName:RIP
settingNum:0
commands: ['configure terminal', 'ip routing', 'router rip', 'network 192.168.2.0', 'version 2', 'no auto-summary', 'end']

[call api]
调用时间：2021-01-13 12.29.38
调用接口：executeSomeCommand
configName:RIP
routerNum:0
commands:['configure terminal', 'ip routing', 'router rip', 'network 192.168.2.0', 'version 2', 'no auto-summary', 'end']
获取Telnet:Router0的唯一对象……
Telnet:Router0对象已经创建，获取成功
executeSomeCMD:
['configure terminal', 'ip routing', 'router rip', 'network 192.168.2.0', 'version 2', 'no auto-summary', 'end']
executeSomeCMD-Result:
['configure terminal\nEnter configuration commands, one per line.  End with CNTL/Z.\nRouter(config)#', 'ip routing\nRouter(config)#', 'router rip\nRouter(config-router)#', 'network 192.168.2.0\nRouter(config-router)#', 'version 2\nRouter(config-router)#', 'no auto-summary\nRouter(config-router)#', 'end\nRouter#']
**程序输出**
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ip routing
Router(config)#router rip
Router(config-router)#network 192.168.2.0
Router(config-router)#version 2
Router(config-router)#no auto-summary
Router(config-router)#end
Router#


[call api]
调用时间：2021-01-13 12.29.45
调用接口：checkIPRoute
configName:RIP
routerNum:0
commands:['show ip route']
获取Telnet:Router0的唯一对象……
Telnet:Router0对象已经创建，获取成功
executeSomeCMD:
['show ip route']
executeSomeCMD-Result:
['show ip route\nCodes: C - connected, S - static, R - RIP, M - mobile, B - BGP\n       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area \n       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2\n       E1 - OSPF external type 1, E2 - OSPF external type 2\n       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2\n       ia - IS-IS inter area, * - candidate default, U - per-user static route\n       o - ODR, P - periodic downloaded static route\n\nGateway of last resort is not set\n\nC    192.168.1.0/24 is directly connected, FastEthernet0/0\nC    192.168.2.0/24 is directly connected, Serial0/0/0\nRouter#']
**程序输出**
Router#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

C    192.168.1.0/24 is directly connected, FastEthernet0/0
C    192.168.2.0/24 is directly connected, Serial0/0/0
Router#


[call api]
调用时间：2021-01-13 12.29.50
调用接口：checkIPProtocols
configName:OSPF
routerNum:0
commands:['show ip protocols']
获取Telnet:Router0的唯一对象……
Telnet:Router0对象已经创建，获取成功
executeSomeCMD:
['show ip protocols']
executeSomeCMD-Result:
['show ip protocols\nRouting Protocol is "ospf 1"\n  Outgoing update filter list for all interfaces is not set\n  Incoming update filter list for all interfaces is not set\n  Router ID 192.168.2.1\n  Number of areas in this router is 2. 2 normal 0 stub 0 nssa\n  Maximum path: 4\n  Routing for Networks:\n    10.0.0.0 0.255.255.255 area 51\n    192.168.2.0 0.0.0.255 area 0\n Reference bandwidth unit is 100 mbps\n  Routing Information Sources:\n    Gateway         Distance      Last Update\n  Distance: (default is 110)\n\nRouting Protocol is "rip"\n  Outgoing update filter list for all interfaces is not set\n  Incoming update filter list for all interfaces is not set\n  Sending updates every 30 seconds, next due in 0 seconds\n  Invalid after 180 seconds, hold down 180, flushed after 240\n  Redistributing: rip\n  Default version control: send version 2, receive version 2\n    Interface             Send  Recv  Triggered RIP  Key-chain\n    Serial0/0/0           2     2                                    \n  Automatic network summarization is not in effect\n  Maximum path: 4\n  Routing for Networks:\n    192.168.2.0\n  Routing Information Sources:\n    Gateway         Distance      Last Update\n  Distance: (default is 120)\n\nRouter#']
**程序输出**
Router#show ip protocols
Routing Protocol is "ospf 1"
  Outgoing update filter list for all interfaces is not set
  Incoming update filter list for all interfaces is not set
  Router ID 192.168.2.1
  Number of areas in this router is 2. 2 normal 0 stub 0 nssa
  Maximum path: 4
  Routing for Networks:
    10.0.0.0 0.255.255.255 area 51
    192.168.2.0 0.0.0.255 area 0
 Reference bandwidth unit is 100 mbps
  Routing Information Sources:
    Gateway         Distance      Last Update
  Distance: (default is 110)

Routing Protocol is "rip"
  Outgoing update filter list for all interfaces is not set
  Incoming update filter list for all interfaces is not set
  Sending updates every 30 seconds, next due in 0 seconds
  Invalid after 180 seconds, hold down 180, flushed after 240
  Redistributing: rip
  Default version control: send version 2, receive version 2
    Interface             Send  Recv  Triggered RIP  Key-chain
    Serial0/0/0           2     2                                    
  Automatic network summarization is not in effect
  Maximum path: 4
  Routing for Networks:
    192.168.2.0
  Routing Information Sources:
    Gateway         Distance      Last Update
  Distance: (default is 120)

Router#


